In [104]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plit

In [112]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
h = pd.Series([True, False, True, True, False, True])

In [4]:
dates = pd.date_range('20130101', periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [48]:
df = pd.DataFrame({'A': 1, 
                    'B': pd.Timestamp('20130102'), 
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test","train","test","train"]),
                    'F': 'foo'
                   })

In [24]:
df

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [25]:
df.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [26]:
df.head()

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [27]:
df.tail()

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [28]:
df.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [29]:
df.columns

Index([u'A', u'B', u'C', u'D', u'E', u'F'], dtype='object')

In [30]:
df.values

array([[1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']], dtype=object)

In [31]:
df.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [32]:
df.T

,0,1,2,3
A,1,1,1,1
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [33]:
df.sort_index(axis=1, ascending=False)

     F      E  D    C          B  A
0  foo   test  3  1.0 2013-01-02  1
1  foo  train  3  1.0 2013-01-02  1
2  foo   test  3  1.0 2013-01-02  1
3  foo  train  3  1.0 2013-01-02  1

In [34]:
 df.sort_values(by='B')

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [35]:
df['A']

0    1
1    1
2    1
3    1
Name: A, dtype: int64

In [36]:
df[0:3]

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo

In [43]:
df.loc[1:2]

   A          B    C  D      E    F
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo

In [44]:
df.loc[:, ['A', 'B']]

   A          B
0  1 2013-01-02
1  1 2013-01-02
2  1 2013-01-02
3  1 2013-01-02

In [51]:
df.iloc[3:5, 0:2]

   A          B
3  1 2013-01-02

In [53]:
df.iloc[[1,2],[0,2]]

   A    C
1  1  1.0
2  1  1.0

In [54]:
df.iloc[1:3, :]

   A          B    C  D      E    F
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo

In [55]:
df.iat[1, 1]

Timestamp('2013-01-02 00:00:00')

In [56]:
df[df.A > 0]

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [58]:
df['G'] = 0

In [59]:
df

   A          B    C  D      E    F  G
0  1 2013-01-02  1.0  3   test  foo  0
1  1 2013-01-02  1.0  3  train  foo  0
2  1 2013-01-02  1.0  3   test  foo  0
3  1 2013-01-02  1.0  3  train  foo  0

In [67]:
s1 = pd.Series(range(4), index = pd.date_range('20130102', periods=4))

In [61]:
s1

2013-01-02    0
2013-01-03    1
2013-01-04    2
2013-01-05    3
2013-01-06    4
2013-01-07    5
Freq: D, dtype: int64

In [62]:
s1.loc['2013-01-03']

1

In [68]:
df['F'] = s1

In [70]:
df

   A          B    C  D      E   F  G
0  1 2013-01-02  1.0  3   test NaN  0
1  1 2013-01-02  1.0  3  train NaN  0
2  1 2013-01-02  1.0  3   test NaN  0
3  1 2013-01-02  1.0  3  train NaN  0

In [65]:
s1

2013-01-02    0
2013-01-03    1
2013-01-04    2
2013-01-05    3
2013-01-06    4
2013-01-07    5
Freq: D, dtype: int64

In [66]:
df

   A          B    C  D      E   F  G
0  1 2013-01-02  1.0  3   test NaN  0
1  1 2013-01-02  1.0  3  train NaN  0
2  1 2013-01-02  1.0  3   test NaN  0
3  1 2013-01-02  1.0  3  train NaN  0

In [71]:
df.iat[0, 1] = 0

In [72]:
df

   A          B    C  D      E   F  G
0  1 1970-01-01  1.0  3   test NaN  0
1  1 2013-01-02  1.0  3  train NaN  0
2  1 2013-01-02  1.0  3   test NaN  0
3  1 2013-01-02  1.0  3  train NaN  0

In [75]:
df2 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [76]:
df2

             A   B   C   D    E   F   G    E
2013-01-01 NaN NaT NaN NaN  NaN NaN NaN  NaN
2013-01-02 NaN NaT NaN NaN  NaN NaN NaN  NaN
2013-01-03 NaN NaT NaN NaN  NaN NaN NaN  NaN
2013-01-04 NaN NaT NaN NaN  NaN NaN NaN  NaN

In [79]:
m = df.mean()

In [80]:
m

A    1.0
C    1.0
D    3.0
F    NaN
G    0.0
dtype: float64

In [81]:
type(m)

pandas.core.series.Series

In [82]:
 s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [83]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [85]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [86]:
s.value_counts()

3    3
4    2
1    2
6    1
5    1
0    1
dtype: int64

In [87]:
s

0    3
1    3
2    6
3    1
4    0
5    3
6    4
7    4
8    5
9    1
dtype: int64

In [88]:
df = pd.DataFrame(np.random.randn(10, 4))

In [89]:
df

          0         1         2         3
0  0.786055  0.645239  0.639250  0.669712
1  1.819384 -0.644046  0.684974 -0.376256
2  1.007984 -0.530075 -0.274554  0.486627
3  0.861956  0.076566 -0.844180  0.062600
4 -1.425489 -0.884965  0.677062 -0.170200
5  0.163261  0.553973  0.822144  1.155816
6  1.253304 -1.307213  0.037661  0.790337
7 -1.166503  0.067679  0.873511 -0.052674
8  1.312907 -1.137482  0.213556 -0.772155
9  0.931199  0.749243  1.034114 -1.408755

In [90]:
pieces = [df[:3], df[3:7], df[7:]]

In [91]:
pd.concat(pieces)

          0         1         2         3
0  0.786055  0.645239  0.639250  0.669712
1  1.819384 -0.644046  0.684974 -0.376256
2  1.007984 -0.530075 -0.274554  0.486627
3  0.861956  0.076566 -0.844180  0.062600
4 -1.425489 -0.884965  0.677062 -0.170200
5  0.163261  0.553973  0.822144  1.155816
6  1.253304 -1.307213  0.037661  0.790337
7 -1.166503  0.067679  0.873511 -0.052674
8  1.312907 -1.137482  0.213556 -0.772155
9  0.931199  0.749243  1.034114 -1.408755

In [95]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D']);df

          A         B         C         D
0  0.574249  0.937733 -1.165049  0.422490
1 -0.302782 -0.990836  0.241940 -0.135253
2 -2.406382 -1.076235  0.408920 -0.592519
3  0.883695 -0.317679  0.935167 -1.815727
4  1.268869  0.607785  0.682628  1.198077
5  2.042575  1.026725 -0.117936  0.432055
6  2.364412  0.931737  0.139010 -3.196842
7 -0.358806  1.065710  0.876992 -0.337227

In [93]:
df.groupby('A').sum()

                  B         C         D
A
-1.764506 -0.431447  1.247883  0.193722
-0.622453 -1.430197 -1.520874  1.394749
-0.407744 -0.958088  2.082672 -1.623925
 0.001590 -1.134749  0.884608  1.368044
 0.278284  1.093538  0.174568  0.859505
 0.313143  0.164277  0.763716 -1.676717
 1.139615  1.000029 -0.010332  0.562799
 3.014390 -1.158510 -0.059324 -0.066418

In [94]:
df.stack()

0  A    3.014390
   B   -1.158510
   C   -0.059324
   D   -0.066418
1  A    0.313143
   B    0.164277
   C    0.763716
   D   -1.676717
2  A   -1.764506
   B   -0.431447
   C    1.247883
   D    0.193722
3  A    1.139615
   B    1.000029
   C   -0.010332
   D    0.562799
4  A    0.278284
   B    1.093538
   C    0.174568
   D    0.859505
5  A    0.001590
   B   -1.134749
   C    0.884608
   D    1.368044
6  A   -0.622453
   B   -1.430197
   C   -1.520874
   D    1.394749
7  A   -0.407744
   B   -0.958088
   C    2.082672
   D   -1.623925
dtype: float64

In [96]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [97]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [98]:
ts.resample('5Min').sum()

2012-01-01    27624
Freq: 5T, dtype: int64

In [99]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

In [100]:
df['grade'] = df["raw_grade"].astype("category")

In [101]:
df

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [102]:
ts = ts.cumsum()

In [103]:
ts.plot()